# SetHookTangentLength Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarBarType..::..SetHookTangentLength Method
RebarBarType Class See Also
---
Identifies the hook tangent length for a hook type
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void SetHookTangentLength(
	ElementId hookId,
	double newLength
)
```

Visual Basic
---
```text
Public Sub SetHookTangentLength ( _
	hookId As ElementId, _
	newLength As Double _
)
```

Visual C++
---
```text
public:
void SetHookTangentLength(
	ElementId^ hookId,
	double newLength
)
```

# ### Parameters
hookId
    Type: Autodesk.Revit.DB..::..ElementId id of the hook type
newLength
    Type: System..::..Double The hook tangent length for a hook type
# Remarks
AutoCalcHookLengths is ignored when this property is set
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | the rebar hook type id hookId is not valid |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
RebarBarType Class
Autodesk.Revit.DB.Structure Namespace